In [1]:
from pandas import *
#pandas 함수 전체 불러오기

In [2]:
A = ['a','a','b','b']
B = [1,2,3,4]
C = ['가','나','다','라']

dt = DataFrame({'에이' : A, 
              '비' : B, 
               '씨' : C})

In [4]:
dt_t = DataFrame([A,B,C],columns = A)
dt_t

   a  a  b  b
0  a  a  b  b
1  1  2  3  4
2  가  나  다  라

In [5]:
dt.head()

   비  씨 에이
0  1  가  a
1  2  나  a
2  3  다  b
3  4  라  b

In [6]:
dt.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
dt.columns

Index(['비', '씨', '에이'], dtype='object')

In [5]:
dt.iloc[:2,1:]
#iloc index숫자로 값 slice

   씨 에이
0  가  a
1  나  a

In [8]:
dt.loc[dt['비'] > 2,:]

   비  씨 에이
2  3  다  b
3  4  라  b

In [9]:
dt.drop_duplicates('에이')
#'에이'열을 기준으로 중복 data 제거한 결과 출력

   비  씨 에이
0  1  가  a
2  3  다  b

In [10]:
dt

   비  씨 에이
0  1  가  a
1  2  나  a
2  3  다  b
3  4  라  b

In [11]:
dt_dr = dt.drop_duplicates('에이')
dt_dr
#'에이'열을 기준으로 중복 data 제거한 결과 dt_dr저장
# 사라진 index찾아주지 회복x

   비  씨 에이
0  1  가  a
2  3  다  b

In [16]:
dt.groupby('에이')
dt

   비  씨 에이
0  1  가  a
1  2  나  a
2  3  다  b
3  4  라  b

In [13]:
dt_dr.index=range(0,len(dt_dr))
dt_dr

   비  씨 에이
0  1  가  a
1  3  다  b

In [16]:
gb_count = dt.groupby('에이').count()
gb_count

    비  씨
에이
a   2  2
b   2  2

In [18]:
gb_mean = dt.groupby('에이').mean()
gb_mean

      비
에이
a   1.5
b   3.5

In [20]:
pv = dt.pivot('비','씨','에이')
pv

씨     가     나     다     라
비
1     a  None  None  None
2  None     a  None  None
3  None  None     b  None
4  None  None  None     b

In [21]:
pv.fillna(0)
#none값 0으로 대체

씨  가  나  다  라
비
1  a  0  0  0
2  0  a  0  0
3  0  0  b  0
4  0  0  0  b

In [24]:
#데이터프레임 합치기
concat([dt,dt],axis = 0)
#axis

   비  씨 에이
0  1  가  a
1  2  나  a
2  3  다  b
3  4  라  b
0  1  가  a
1  2  나  a
2  3  다  b
3  4  라  b

In [25]:
concat([dt,dt],axis = 1)

   비  씨 에이  비  씨 에이
0  1  가  a  1  가  a
1  2  나  a  2  나  a
2  3  다  b  3  다  b
3  4  라  b  4  라  b

In [26]:
merge(dt,dt,on = '비')

   비 씨_x 에이_x 씨_y 에이_y
0  1   가    a   가    a
1  2   나    a   나    a
2  3   다    b   다    b
3  4   라    b   라    b

In [27]:
dt.to_excel('test.xlsx')